[{"id":"60976",
"name":"Open Doors Part I",
"time":"2018-03-01 08:00:00",
"location":"Barbie Tootle Room - Ohio Union 3rd Floor",
"description":"Part of the Diversity and Implicit Bias Awareness Program for grad/prof students and postdocs.  This session will cover module 1 of Open Doors.  More information about the Open Doors program is available online. To register for this and other Diversity and Implicit Bias Awareness Program activities use the online go.osu.edu/DIBP18.  https://activities.osu.edu/involvement/graduate_and_professional/2018_DIBP "}
,{"id":"60627",
"name":"OUAB Karaoke Night",
"time":"2018-03-01 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":"OUAB presents Karaoke Night hosted by DJ Rob Stylz! Come grab the mic and sing your favorite song. Or just take a seat and watch he show! Free food while you're here!   7pm at Woody's Tavern, Ohio Union.   The themes for Spring 2018 are:    January 18: Duets  February 1: 2000s R&B and Hip-Hop February 15: Love Songs  March 1: International Music  March 29: Throwback Thursday (Only '90s Kids Remember) April 12: Boy Bands vs. Girl Bands  Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60306",
"name":"Interviewing Skills Workshop",
"time":"2018-03-05 16:00:00",
"location":"Ohio Union, Senate Chamber",
"description":" Career Counseling and Support Services will be presenting an interview skills workshop. The focus of the Workshop will be on being proactive in the interview so that students feel that they have control over what is being communicated and strategies for answering specific questions that are commonly asked. Click link below to register  http://go.osu.edu/JobSearch "}
,{"id":"60221",
"name":"OUABe Fit: Yoga",
"time":"2018-03-05 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"This class moves through a variety of yoga poses in a balanced and systematic way. A key component of this class is Vinyasa work: the union of the breath and movement. Benefits of this type of training include heightened body awareness and mind focus, tension release, increased range of motion at the joints and an overall sensation of more balance in life. The session ends with restorative work, which energizes the body through passive stretch techniques. Sticky mats are provided or feel free to bring your own. "}
,{"id":"60365",
"name":"OUAB Flicks for Free ft. Coco",
"time":"2018-03-07 18:00:00",
"location":"U.S. Bank Conference Theater, Ohio Union",
"description":"OUAB weekly Flicks for Free series presents Coco (PG).  Despite his family's generations-old ban on music, young Miguel dreams of becoming an accomplished musician like his idol Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead. After meeting a charming trickster named Héctor, the two new friends embark on an extraordinary journey to unlock the real story behind Miguel's family history. Stars: Benjamin Bratt, Gael Garcia Bernal Released: 2017   Showings are at 6pm & 8:30pm. Valid BuckID required for entry- BuckID admits two. Free popcorn & beverages! Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"61019",
"name":"OUAB in the Kitchen - Foods of Ireland",
"time":"2018-03-07 18:00:00",
"location":"Ohio Union, Instructional Kitchen",
"description":" Join OUAB in the Instructional Kitchen at the Ohio Union for a chance to cook a meal of your own under the guidance of the Union's own professional chef, Chef Wolf. Following a cooking demonstration by the chef, students will collaborate with class members to create the menu providing a unique hands-on learning opportunity. In this fun and interactive environment students will enjoy a delicious meal and gain useful culinary skills to show off in their own kitchens.  Whether you're are a master chef in your own kitchen or a novice, there is an OUAB in the Kitchen program for you. Please note that due to safety, children are not permitted to attend this cooking class. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on February 22.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on February 23. Register here: https://ouab.osu.edu/secure/events/?eventId=27   Frequently Asked Questions "}
,{"id":"61064",
"name":"OUAB Grad/Prof Wellness Workshop: You Snooze, You Don't Lose",
"time":"2018-03-08 24:00:00",
"location":"Ohio Union, Tanya Rutner Room",
"description":"Join us as we discusspriortizing sleep in our busy lives, as brought to you by the Student Wellness Center.    Students will reflect on how they prioritize sleep in their lives and learn the importance of getting adequate sleep in college. Additionally, this session will present various sleep positive practices students can implement in their daily lives.   Lunch will be provided.  Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60300",
"name":"OUAB Grad/Prof Trivia Night",
"time":"2018-03-08 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":" Join us as grad/prof students get together for a night of food, fun, and games! Pre-arranged and impromptu-created teams compete in this night of trivia competition. Prizes are awarded to the top three teams and the last place team. All participants are eligible for door prizes. To purchase Ohio beer or wine, please remember to bring proper identification.  Check in begins at 6:30p.m. with the first question promptly at 7:00 p.m.All teams must register for each quiz night. Please include roster and team name with registration (teams may include up to 50% non-student guests). Due to overwhelming popularity, registrations the day of the quiz may not be available. The registration period for a quiz night begins at the conclusion of the previous quiz night. Please send registration information to ouab.grad.prof@gmail.com. "}
,{"id":"61068",
"name":"OUAB Grad/Prof Goes to Black Light Miniature Golf at Miner 49er",
"time":"2018-03-09 19:00:00",
"location":"1158 W. 3rd Avenue, Suite B",
"description":"OUAB Grad/Prof Programming strives to provide opportunities to allow for our students to interact and network with students among and between different graduate and professional programs. Join OUAB Grad/Prof at Miner 49er Black Light Miniature Golf on Friday, March 9, 2018 at 7:00 PM. OUAB Grad/Prof will be covering the cost of admission for 50 students. Registration for this event will be through our lottery system. 50 students will be randomly selected to receive free admission to Black Light Mini Golf at Miner 49er. Winners will be notified by noon, March 7. You must receive an email confirming your participation at this event in order to attend. If you do not receive an email confirming your participation, you will be unable to receive free admission.   Link to register - http://go.osu.edu/MiniGolf   "}
,{"id":"60307",
"name":"Salary Negotiation Workshop",
"time":"2018-03-19 16:00:00",
"location":"Ohio Union, Senate Chamber",
"description":" Career Counseling and Support Services will present a presentation on Salary Negotiations. The presentation will discuss salary negotiation strategies including how to find the amount that you can expect to earn for a particular field as well as how and when to negotiate.   Click here to register  http://go.osu.edu/JobSearch "}
,{"id":"61094",
"name":"OUAB Grad/Prof Goes to Glass Axis",
"time":"2018-03-20 17:00:00",
"location":"Glass Axis - 610 W. Town St.",
"description":" Experience Columbus with OUAB at Glass Axis! If you have ever been intrigued by the art of glass blowing, now is your opportunity to create a work of art yourself. Glass Axis is hosting OUAB and glass artists will instruct students how to make a blown glass ornament. Register for one of the hour and a half sessions – 5:30 or 7:00. Space is limited to ensure one-on-one instruction from the artists. Registration for this event will be through the lottery system. Winners will be notified on Friday, March 16 by noon of their participation in this event. You must receive an email confirmation to participate in this event.   Link to register to 5:30 PM Class - https://ouab.osu.edu/secure/events/?eventId=40 Link to register to 7:00 PM Class - https://ouab.osu.edu/secure/events/?eventId=41 "}
,{"id":"61102",
"name":"OUAB Presents: An Evening with Jemele Hill ",
"time":"2018-03-20 19:30:00",
"location":"Ohio Union Archie Griffin Grand Ballroom",
"description":"OUAB is extremely excited to be partnering with Sustained Dialogue, BSA, USG, and so many other great orgs to host a Voice Your Vision week to amp up the discussion on police and race relations. Jemele Hill as a keynote speaker on March 20th at 7:30 PM and will provide an amazing perspective, as someone who has been prosecuted for standing up for those without a voice. This event will not be ticketed, so just show up and learn about important issues and how we can take steps to make this society a more welcoming place for all people!   EVENT IS NOT TICKETED BUT A BUCKID IS REQUIRED FOR ENTRY. ONE BUCKID ADMITS TWO PEOPLE. DOORS OPEN AT 6 PM.    Jemele Hill is a contributor to ESPN’s The Undefeated, a platform that fuses sports, race, and culture. She was previously co-host of ESPN’s flagship SportsCenter. Prior to that, Hill wrote a column for ESPN.com’s Page 2 and hosted ESPN’s His and Hers, a statistics-based sports discussion program.   Born in Detroit, MI, Hill went on to attend Michigan State University. She began her career as a sports writer with the Detroit Free Press, primarily covering Michigan State football and basketball. While there, she also covered the 2004 Summer Olympics and NBA Playoffs. Hill joined ESPN in 2006 as a national columnist for ESPN.com. She made regular appearances on television, including SportsCenter and several other ESPN programs, including ESPN First Take, Outside the Lines and The Sports Reporters. In 2007, she was awarded the inaugural Van McKenzie Cup, an award created to recognize a journalist who best exemplifies the traits of the innovative sports editor for whom it is named. Hill credits McKenzie, in large part, for her breakneck rise. In 2011, Hill and Michael Smith began the podcast His & Hers. Its popularity led to ESPN adding Hill to Smith’s ESPN2 show Numbers Never Lie, which was renamed to His & Hers a year later. The show aired successfully for 6 years, when both Hill and Smith became evening anchors of ESPN’s SportsCenter. Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60290",
"name":"STAR Workshop Breakfast: Student Motivation",
"time":"2018-03-21 09:00:00",
"location":"Ohio Union, Barbie Tootle Room",
"description":"As graduate students, it can sometimes be a struggle to understand why our students aren’t motivated by the same things that seem important to us. In this meeting, participants will learn about motivators that affect student engagement and discuss how challenges to motivation are shaped by our course context. Participants will develop a game plan for overcoming these challenges including easy to implement strategies that can be applied immediately and throughout the semester. Co-sponsored by OUAB Grad/Prof and UCAT. "}
,{"id":"60366",
"name":"OUAB Flicks for Free ft. Jumanji: Welcome to the Jungle",
"time":"2018-03-21 18:00:00",
"location":"U.S. Bank Conference Theater, Ohio Union",
"description":"OUAB weekly Flicks for Free series presents Jumanji: Welcome to the Jungle (PG-13).    Four high school kids discover an old video game console and are drawn into the game's jungle setting, literally becoming the adult avatars they chose. To beat the game and return to the real world, they'll have to go on the most dangerous adventure of their lives, discover what Alan Parrish left 20 years ago, and change the way they think about themselves - or they'll be stuck in the game forever. Stars: Dwayne Johnson, Jack Black, Karen Gillian, Kevin Hart Released: 2017   Showings are at 6pm & 8:30pm. Valid BuckID required for entry- BuckID admits two. Free popcorn & beverages! Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60241",
"name":"OUABe Fit: Barre None",
"time":"2018-03-21 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"Barre None is a combination of ballet, Pilates, and yoga-inspired exercises designed to strengthen, sculpt, and lengthen your muscles. While this class targets your glutes, legs and core, it will improve your overall balance, flexibility and strength. "}
,{"id":"61020",
"name":"OUAB in the Kitchen - Hors D'oeuvres",
"time":"2018-03-22 18:00:00",
"location":"Ohio Union, Instructional Kitchen",
"description":" Join OUAB in the Instructional Kitchen at the Ohio Union for a chance to cook a meal of your own under the guidance of the Union's own professional chef, Chef Wolf. Following a cooking demonstration by the chef, students will collaborate with class members to create the menu providing a unique hands-on learning opportunity. In this fun and interactive environment students will enjoy a delicious meal and gain useful culinary skills to show off in their own kitchens.  Whether you're are a master chef in your own kitchen or a novice, there is an OUAB in the Kitchen program for you. Please note that due to safety, children are not permitted to attend this cooking class. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on March 7.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on March 8. Register here: https://ouab.osu.edu/secure/events/?eventId=28   Frequently Asked Questions "}
,{"id":"60301",
"name":"OUAB Grad/Prof Trivia Night",
"time":"2018-03-22 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":" Join us as grad/prof students get together for a night of food, fun, and games! Pre-arranged and impromptu-created teams compete in this night of trivia competition. Prizes are awarded to the top three teams and the last place team. All participants are eligible for door prizes. To purchase Ohio beer or wine, please remember to bring proper identification.  Check in begins at 6:30p.m. with the first question promptly at 7:00 p.m.All teams must register for each quiz night. Please include roster and team name with registration (teams may include up to 50% non-student guests). Due to overwhelming popularity, registrations the day of the quiz may not be available. The registration period for a quiz night begins at the conclusion of the previous quiz night. Please send registration information to ouab.grad.prof@gmail.com. "}
,{"id":"61021",
"name":"OUAB in the Kitchen - Soul Food",
"time":"2018-03-26 18:00:00",
"location":"Ohio Union, Instructional Kitchen",
"description":" Join OUAB in the Instructional Kitchen at the Ohio Union for a chance to cook a meal of your own under the guidance of the Union's own professional chef, Chef Wolf. Following a cooking demonstration by the chef, students will collaborate with class members to create the menu providing a unique hands-on learning opportunity. In this fun and interactive environment students will enjoy a delicious meal and gain useful culinary skills to show off in their own kitchens.  Whether you're are a master chef in your own kitchen or a novice, there is an OUAB in the Kitchen program for you. Please note that due to safety, children are not permitted to attend this cooking class. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on March 15.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on March 16. Register here: https://ouab.osu.edu/secure/events/?eventId=30   Frequently Asked Questions "}
,{"id":"61077",
"name":"OUABare Necessities of Animation with Floyd Norman",
"time":"2018-03-26 18:00:00",
"location":"Ohio Union West Ballroom",
"description":"OUABare Necessities of Animation w/ Floyd NormanMonday, March 26thDrawing Masterclass: 6-7 pm West BallroomAn Animated Life Documentary: 7:30-9:05 pm US Bank Conference TheaterQ&A with Floyd: 9:05-10:00 pm US Bank Conference TheaterStudents do not need to attend all portions of this event: They can go to just the masterclass or just the documentary or just the Q&A, or two of the three, or all three. Who is Floyd?Floyd Norman is an animator, comic book artist, and script writer who made history in 1956 by becoming the first African American cartoon animator at the Disney studios, where he worked directly with Walt Disney. Over the course of his career, Norman has worked for a number of animation companies, among them Walt Disney Animation Studios, Hanna-Barbera Productions, Ruby-Spears, Film Roman, and Pixar. His most notable work includes Sleeping Beauty, The Sword in the Stone, The Jungle Book, Mary Poppins, One Hundred and One Dalmatians, Toy Story 2, Monsters, Inc., and the Mickey Mouse comic strip. After finishing work in 2001 on Monsters, Inc., Norman officially retired. However, to this day he likes to keep involved in the business by doing occasional work as a freelance consultant and storyboard artist on various projects. Now in his 80s, he's traveling and promoting his documentary Floyd Norman: An Animated Life.   Tickets required - grab yours now at the Ohio Union Information Desk. 2/BuckID. Tickets and valid BuckID required for entry.   Event Open to students, faculty/staff, and regional campuses.  Ticketing Information: Tickets Required "}
,{"id":"60222",
"name":"OUABe Fit: Yoga",
"time":"2018-03-26 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"This class moves through a variety of yoga poses in a balanced and systematic way. A key component of this class is Vinyasa work: the union of the breath and movement. Benefits of this type of training include heightened body awareness and mind focus, tension release, increased range of motion at the joints and an overall sensation of more balance in life. The session ends with restorative work, which energizes the body through passive stretch techniques. Sticky mats are provided or feel free to bring your own. "}
,{"id":"60237",
"name":"OUABe Fit: Zumba",
"time":"2018-03-27 18:00:00",
"location":"Ohio Union, Dance Room 2",
"description":"Tired of the treadmill? This class is a high-energy, dance-inspired workout that fuses traditional Latin rhythms such as Salsa and Merengue with hip hop. Each class features simple, yet incredibly fun routines that help tone your body and get your heart rate up! Dance experience is not required; our instructor will work with participants to ensure the best results. You will have so much fun that you'll forget you're working out! "}
,{"id":"60294",
"name":"Cupcakes and Canvases with Cody",
"time":"2018-03-28 17:00:00",
"location":"Ohio Union, Creative Arts Room",
"description":"Relaxing and making time for entertainment is a crucial part of overall wellness. With this in mind, join us for an evening of cupcakes and canvases with local artist Cody Heichel. Participants are invited to relax, enjoy sweet treats and paint on a canvas with fellow students. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on Thursday, March 15.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on March 16. Click link to register - https://ouab.osu.edu/secure/events/?eventId=14 * Note: Check-in for this event begins at 4:45 PM. Students should NOT arrive before this time.  Frequently Asked Questions "}
,{"id":"60367",
"name":"OUAB Flicks for Free ft. Cadet Kelly and Life Size ",
"time":"2018-03-28 18:00:00",
"location":"U.S. Bank Conference Theater, Ohio Union",
"description":"OUAB weekly Flicks for Free series presents Cadet Kelly (G) and Life Size (G).  Cadet Kelly will play at 6:00 PM ONLY. A fashion-conscious youngster is horrified when she is forced to move to military school. Stars: Hilary Duff, Christy Carlson Romano, Gary Cole  Released: 2002   Life Size will play at 8:30 PM ONLY.  A widower's daughter uses magic to try and resurrect her mother but ends up bringing a doll to life. Stars: Tyra Banks, Lindsay Lohan Released: 2000   Valid BuckID required for entry- BuckID admits two. Free popcorn & beverages! Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60242",
"name":"OUABe Fit: Barre None",
"time":"2018-03-28 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"Barre None is a combination of ballet, Pilates, and yoga-inspired exercises designed to strengthen, sculpt, and lengthen your muscles. While this class targets your glutes, legs and core, it will improve your overall balance, flexibility and strength. "}
,{"id":"60628",
"name":"OUAB Karaoke Night",
"time":"2018-03-29 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":"OUAB presents Karaoke Night hosted by DJ Rob Stylz! Come grab the mic and sing your favorite song. Or just take a seat and watch he show! Free food while you're here!   7pm at Woody's Tavern, Ohio Union.   The themes for Spring 2018 are:    January 18: Duets  February 1: 2000s R&B and Hip-Hop February 15: Love Songs  March 1: International Music  March 29: Throwback Thursday (Only '90s Kids Remember) April 12: Boy Bands vs. Girl Bands  Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"61076",
"name":"OUAB Presents: Redefining Masculinity with Justin Baldoni",
"time":"2018-03-29 20:00:00",
"location":"Ohio Union East Ballroom",
"description":"Join OUAB on March 29, 2018 at 8:00pm. Tickets available now! 2/BuckID at the Ohio Union Information Desk. Justin Baldoni is an American actor, director and filmmaker. In 2014, Baldoni started playing Rafael Solano in the CW show Jane the Virgin. On November 2, 2017, Baldoni spoke at the 2017 TEDWomen Conference in New Orleans, Louisiana. The TEDTalk video of the speech was released on December 4th, 2017. In his talk, Baldoni discussed his struggle trying to fit into societies' expectations of being a man. The speech discussed how he plans to ignite the dialogue regarding men and masculinity. Baldoni discusses how his childhood has affected the man he has become and how he is trying to be a better person by redefining masculinity. The TED talk can be found here -> https://www.ted.com/talks/justin_baldoni_why_i_m_done_trying_to_be_man_enough   Tickets and valid BuckID required for entry. Doors open at 7:00 pm. Event Open to students, faculty/staff, and regional campuses.  Ticketing Information: Tickets Required "}
,{"id":"61075",
"name":"OUAB Presents Michelle Wolf",
"time":"2018-03-31 19:00:00",
"location":"Ohio Union Grand Ballroom",
"description":"OUAB is hosting comedian Michelle Wolf on March 31st, 2018! Michelle Wolf is a NY-based writer, actor and standup comedian and one of the fastest rising comedic talents in the city.  She currently works as an on-air contributor and writer for Comedy Central’s The Daily Show with Trevor Noah. Prior to joining The Daily Show, Michelle was a writing supervisor and performer on Late Night with Seth Meyers, where she also made her late night television debut as a comic in July 2014.  Michelle appears regularly on the show in various bits and as the popular reoccurring character she created, “Grown-Up Annie.” Show starts at 7pm. Doors open at 6pm. Tickets are required, so pick yours up from the Information Desk! Tickets are available at 2/BuckID. Event Open to students, faculty/staff, and regional campuses.  Please show a valid BuckID at the door- one BuckID can be used to admit yourself & a guest. Get ready to laugh! Ticketing Information: Tickets Required "}
,{"id":"60223",
"name":"OUABe Fit: Yoga",
"time":"2018-04-02 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"This class moves through a variety of yoga poses in a balanced and systematic way. A key component of this class is Vinyasa work: the union of the breath and movement. Benefits of this type of training include heightened body awareness and mind focus, tension release, increased range of motion at the joints and an overall sensation of more balance in life. The session ends with restorative work, which energizes the body through passive stretch techniques. Sticky mats are provided or feel free to bring your own. "}
,{"id":"61078",
"name":"OUABreaking Barriers with Misty Copeland",
"time":"2018-04-02 19:00:00",
"location":"Ohio Union Grand Ballroom",
"description":"Event begins at 7:00pm. Doors open at 6:00pm. Ticket and valid BuckID required for entry. Free tickets available starting Monday, March 5th at 5 p.m. at the Info Desk. 2/BuckID.- Misty Copeland is the first African American principal ballerina for the American Ballet Theatre, one of the most prestigious ballet companies in the world. - Misty didn't begin ballet until age 13 (which is considered very old in the dance world). Despite this, she became a prodigy by age 15, and was fielding offers from ballet companies around the nation- Misty began dancing at her local Boys and Girls Club. When her mother told her she'd have to give up ballet for financial and family reasons, Misty moved in with her dance teachers to continue her training. She later emancipated from her mother to pursue her career.- In 2015, Misty was named one of Time's 100 Most Influential people in the World- Misty has a documentary (A Ballerina's Tale), two books (Life in Motion: An Unlikely Ballerina and Ballerina Body), a children's book (Firebird), and a barbie!   The books Life In Motion and Ballerina Body will be for sale at the event. Book signing immediately following.    Event Open to students, faculty/staff, and regional campuses.  Ticketing Information: Tickets Required "}
,{"id":"60228",
"name":"OUABe Fit: Zumba",
"time":"2018-04-03 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"Tired of the treadmill? This class is a high-energy, dance-inspired workout that fuses traditional Latin rhythms such as Salsa and Merengue with hip hop. Each class features simple, yet incredibly fun routines that help tone your body and get your heart rate up! Dance experience is not required; our instructor will work with participants to ensure the best results. You will have so much fun that you'll forget you're working out! "}
,{"id":"60251",
"name":"OUABe Fit: Barre None",
"time":"2018-04-04 17:00:00",
"location":"Women's Field House (beside RPAC, next to Lincoln tuft fields)",
"description":"Barre None is a combination of ballet, Pilates, and yoga-inspired exercises designed to strengthen, sculpt, and lengthen your muscles. While this class targets your glutes, legs and core, it will improve your overall balance, flexibility and strength. "}
,{"id":"60368",
"name":"OUAB Flicks for Free ft.Thor: Ragnarok",
"time":"2018-04-04 18:00:00",
"location":"U.S. Bank Conference Theater, Ohio Union",
"description":"OUAB weekly Flicks for Free series presents Thor: Ragnarok (PG-13).  Imprisoned on the other side of the universe, the mighty Thor finds himself in a deadly gladiatorial contest that pits him against the Hulk, his former ally and fellow Avenger. Thor's quest for survival leads him in a race against time to prevent the all-powerful Hela from destroying his home world and the Asgardian civilization. Stars: Chris Hemsworth, Tom Hiddleston, Mark Ruffalo Released: 2017   Showings are at 6pm & 8:30pm. Valid BuckID required for entry- BuckID admits two. Free popcorn & beverages! Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60302",
"name":"OUAB Grad/Prof Trivia Night",
"time":"2018-04-05 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":" Join us as grad/prof students get together for a night of food, fun, and games! Pre-arranged and impromptu-created teams compete in this night of trivia competition. Prizes are awarded to the top three teams and the last place team. All participants are eligible for door prizes. To purchase Ohio beer or wine, please remember to bring proper identification.  Check in begins at 6:30p.m. with the first question promptly at 7:00 p.m.All teams must register for each quiz night. Please include roster and team name with registration (teams may include up to 50% non-student guests). Due to overwhelming popularity, registrations the day of the quiz may not be available. The registration period for a quiz night begins at the conclusion of the previous quiz night. Please send registration information to ouab.grad.prof@gmail.com. "}
,{"id":"61117",
"name":"OUAB Grad/Prof Presents Friend Connecting",
"time":"2018-04-06 17:30:00",
"location":"Ohio Union, Woody's Tavern",
"description":" Too busy to meet new people? Always stuck in the lab? Come socialize, network and make new friends with like-minded graduate and professional students. OUAB Grad Prof presents Friend Connecting. It’s a simple process based on a speed dating format. Participants will have a few minute at a time to interact one on one. If connections are made contact information is shared.  Remember, this is event is intended participants to meet new people and strictly platonic. Now there is now need to have lab equipment as your closest friends.  To purchase Ohio beer or wine, please remember to bring proper identification. Check in begins at 5:30p.m. the event begins at 6:15p.m. This event is NOT speed dating/predating. However, you must still register at www.predating.com/osu. "}
,{"id":"60369",
"name":"OUAB Flicks for Free ft.Thor: Ragnarok",
"time":"2018-04-06 18:00:00",
"location":"U.S. Bank Conference Theater, Ohio Union",
"description":"OUAB weekly Flicks for Free series presents Thor: Ragnarok (PG-13).  Imprisoned on the other side of the universe, the mighty Thor finds himself in a deadly gladiatorial contest that pits him against the Hulk, his former ally and fellow Avenger. Thor's quest for survival leads him in a race against time to prevent the all-powerful Hela from destroying his home world and the Asgardian civilization. Stars: Chris Hemsworth, Tom Hiddleston, Mark Ruffalo Released: 2017   Showings are at 6pm & 8:30pm. Valid BuckID required for entry- BuckID admits two. Free popcorn & beverages! Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"61118",
"name":"OUAB Live Music Night",
"time":"2018-04-08 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":"Live Music Night presented by The Ohio Union Activities Board   April 8 / 7-9PM / Free Food!   Do you sing, rap, or play an instrument or enjoy live music? Join us Sunday, March 4 in Woody's Tavern for Live Music Night!   Sign up here go.osu.edu/livemusicnight "}
,{"id":"60308",
"name":"Preparing for the Academic Job Search",
"time":"2018-04-09 14:30:00",
"location":"Ohio Union, U.S. Bank Conference Theater",
"description":" Getting ready to go on the job market in academia? We’ll provide helpful tips for starting your job search, including where and how to look for faculty openings and what materials need to be prepared. This presentation is co-sponsored with OUAB Grad/Prof. Join UCAT and Career Counseling and Support Services for a workshop series Autumn 2018.   Click link to register https://www.surveymonkey.com/r/JPYF8SP "}
,{"id":"61126",
"name":"OUAB Flicks for Free ft. Wreck-It Ralph ",
"time":"2018-04-09 16:30:00",
"location":"Gateway Film Center ",
"description":"Arcade Games beginning at 4:30 pm in the Gateway Film Center Lounge  Movie at 6 pm, one showing only  Wreck-It Ralph: https://www.youtube.com/watch?v=87E6N7ToCxs (Wreck-It Ralph 2 will be out in November, so this is your chance to see the first one ~for free~)   Students will receive a voucher for entry into the lounge area/movie, and that voucher will get one popcorn and drink.   In the lounge area, we will be having arcade games that are related to Wreck-It Ralph. Students are welcome to play the games before and during the movie. The movie will be in one of their theaters, not in the lounge area, so people can watch the movie in peace. Family friendly so bring the kids!  https://ouab.osu.edu/ "}
,{"id":"60224",
"name":"OUABe Fit: Yoga",
"time":"2018-04-09 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"This class moves through a variety of yoga poses in a balanced and systematic way. A key component of this class is Vinyasa work: the union of the breath and movement. Benefits of this type of training include heightened body awareness and mind focus, tension release, increased range of motion at the joints and an overall sensation of more balance in life. The session ends with restorative work, which energizes the body through passive stretch techniques. Sticky mats are provided or feel free to bring your own. "}
,{"id":"60238",
"name":"OUABe Fit: Zumba",
"time":"2018-04-10 18:00:00",
"location":"Ohio Union, Dance Room 2",
"description":"Tired of the treadmill? This class is a high-energy, dance-inspired workout that fuses traditional Latin rhythms such as Salsa and Merengue with hip hop. Each class features simple, yet incredibly fun routines that help tone your body and get your heart rate up! Dance experience is not required; our instructor will work with participants to ensure the best results. You will have so much fun that you'll forget you're working out! "}
,{"id":"60370",
"name":"OUAB Flicks for Free ft. The Post",
"time":"2018-04-11 18:00:00",
"location":"U.S. Bank Conference Theater, Ohio Union",
"description":"OUAB weekly Flicks for Free series presents The Post (PG-13).  Katharine Graham is the first female publisher of a major American newspaper -- The Washington Post. With help from editor Ben Bradlee, Graham races to catch up with The New York Times to expose a massive cover-up of government secrets that spans three decades and four U.S. presidents. Stars: Meryl Streep, Tom Hanks Released: 2017   Showings are at 6pm & 8:30pm. Valid BuckID required for entry- BuckID admits two. Free popcorn & beverages! Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"61022",
"name":"OUAB in the Kitchen - Spring Brunch in Paris",
"time":"2018-04-11 18:00:00",
"location":"Ohio Union, Instructional Kitchen",
"description":" Join OUAB in the Instructional Kitchen at the Ohio Union for a chance to cook a meal of your own under the guidance of the Union's own professional chef, Chef Wolf. Following a cooking demonstration by the chef, students will collaborate with class members to create the menu providing a unique hands-on learning opportunity. In this fun and interactive environment students will enjoy a delicious meal and gain useful culinary skills to show off in their own kitchens.  Whether you're are a master chef in your own kitchen or a novice, there is an OUAB in the Kitchen program for you. Please note that due to safety, children are not permitted to attend this cooking class. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on March 29.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on March 30. Register here: https://ouab.osu.edu/secure/events/?eventId=26   Frequently Asked Questions "}
,{"id":"60243",
"name":"OUABe Fit: Barre None",
"time":"2018-04-11 00:00:00",
"description":""}
,{"id":"60629",
"name":"OUAB Karaoke Night",
"time":"2018-04-12 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":"OUAB presents Karaoke Night hosted by DJ Rob Stylz! Come grab the mic and sing your favorite song. Or just take a seat and watch he show! Free food while you're here!   7pm at Woody's Tavern, Ohio Union.   The themes for Spring 2018 are:    January 18: Duets  February 1: 2000s R&B and Hip-Hop February 15: Love Songs  March 1: International Music  March 29: Throwback Thursday (Only '90s Kids Remember) April 12: Boy Bands vs. Girl Bands  Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60225",
"name":"OUABe Fit: Yoga",
"time":"2018-04-16 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"This class moves through a variety of yoga poses in a balanced and systematic way. A key component of this class is Vinyasa work: the union of the breath and movement. Benefits of this type of training include heightened body awareness and mind focus, tension release, increased range of motion at the joints and an overall sensation of more balance in life. The session ends with restorative work, which energizes the body through passive stretch techniques. Sticky mats are provided or feel free to bring your own. "}
,{"id":"60239",
"name":"OUABe Fit: Zumba",
"time":"2018-04-17 18:00:00",
"location":"Ohio Union, Dance Room 2",
"description":"Tired of the treadmill? This class is a high-energy, dance-inspired workout that fuses traditional Latin rhythms such as Salsa and Merengue with hip hop. Each class features simple, yet incredibly fun routines that help tone your body and get your heart rate up! Dance experience is not required; our instructor will work with participants to ensure the best results. You will have so much fun that you'll forget you're working out! "}
,{"id":"60291",
"name":"STAR Workshop Breakfast: Teaching Statements",
"time":"2018-04-18 09:00:00",
"location":"Ohio Union, Barbie Tootle Room",
"description":"The process of identifying a personal philosophy of teaching and continuously examining it through teaching practice can foster professional and personal growth. You will find out about benefits and uses of a teaching statement in academia and your teaching. You will also have the opportunity to start developing your own statement. Monthly breakfast co-sponsored by OUAB Grad/Prof and UCAT.  "}
,{"id":"60246",
"name":"OUABe Fit: Barre None",
"time":"2018-04-18 00:00:00",
"description":""}
,{"id":"60371",
"name":"OUAB Movie on the Oval ft. Star Wars: The Last Jedi",
"time":"2018-04-18 19:00:00",
"location":"The Oval",
"description":" OUAB presents Movie on the Oval, featuring Star Wars: The Last Jedi! Grab something to sit on and your friends and come check out a great movie! What: An outdoor showing of  Star Wars: The Last Jedi (PG-13) Where: The Oval. Rain location: Archie M. Griffin Grand Ballroom When:April 18, 2018, 8:30 PM showing only  Must have valid BuckID.   Assorted snacks and drinks provided! Please bring a towel, blanket, chair, etc. to sit on and enjoy the show.   Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares to do battle with the First Order. Stars: Carrie Fisher, Daisy Ridley, Mark Hamil, Adam Driver Released: 2017 Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"61023",
"name":"OUAB in the Kitchen - Upscale Gastropub Gastronomy",
"time":"2018-04-19 18:00:00",
"location":"Ohio Union, Instructional Kitchen",
"description":" Join OUAB in the Instructional Kitchen at the Ohio Union for a chance to cook a meal of your own under the guidance of the Union's own professional chef, Chef Wolf. Following a cooking demonstration by the chef, students will collaborate with class members to create the menu providing a unique hands-on learning opportunity. In this fun and interactive environment students will enjoy a delicious meal and gain useful culinary skills to show off in their own kitchens.  Whether you're are a master chef in your own kitchen or a novice, there is an OUAB in the Kitchen program for you. Please note that due to safety, children are not permitted to attend this cooking class. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on April 5.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on April 6. Register here: https://ouab.osu.edu/secure/events/?eventId=29   Frequently Asked Questions "}
,{"id":"60303",
"name":"OUAB Grad/Prof Trivia Night",
"time":"2018-04-19 19:00:00",
"location":"Ohio Union, Woody's Tavern",
"description":" Join us as grad/prof students get together for a night of food, fun, and games! Pre-arranged and impromptu-created teams compete in this night of trivia competition. Prizes are awarded to the top three teams and the last place team. All participants are eligible for door prizes. To purchase Ohio beer or wine, please remember to bring proper identification.  Check in begins at 6:30p.m. with the first question promptly at 7:00 p.m.All teams must register for each quiz night. Please include roster and team name with registration (teams may include up to 50% non-student guests). Due to overwhelming popularity, registrations the day of the quiz may not be available. The registration period for a quiz night begins at the conclusion of the previous quiz night. Please send registration information to ouab.grad.prof@gmail.com. "}
,{"id":"60350",
"name":"OUAB Grad/Prof Spring Picnic",
"time":"2018-04-20 16:00:00",
"location":"OSU Faculty Club",
"description":"Join fellow grad/prof students and their guests kick back as the weekend gets started and the semester winds down at this annual spring event. Enjoy free food, cash bar, corn hole, live music and prizes. New for this year is our outdoor grill and  build your own ice cream sundaes for a spring picnic theme. Vegetarian options will be provided. To purchase Ohio beer or wine, please remember to bring proper identification and CASH. Credit cards are not accepted. The Grad/Prof Picnic is at the OSU Faculty Club and will take place from 4:00 - 7:00 PM. "}
,{"id":"61079",
"name":"OUAB Grad/Prof and Buckeye Village Spring Family Festival",
"time":"2018-04-21 11:30:00",
"location":"Buckeye Village ",
"description":"Students with families are invited to join OUAB and Buckeye Village for a FREE afternoon of fun. Come out and enjoy the playground, inflatables, face painters, balloon artists, food and friends. This event is appropriate for studetn and family members of all ages.    "}
,{"id":"61128",
"name":"OUAB Presents: OSU's Got Talent!",
"time":"2018-04-22 18:30:00",
"location":"Ohio Union Archie M. Griffin Grand Ballroom",
"description":"OUAB presents Ohio State’s Got Talent on Sunday April 22nd at 6:30pm! Featuring performances from previous contestants on the show “America’s Got Talent” such as contortionist Sofie Dossi, magician Eric Jones, and the knife throwing duo Deadly Games! Got talent? You can perform too! Sign up at go.osu.edu/gottalent Free tickets to watch are available at the Ohio Union Info Desk. Tickets are FREE with a valid BuckID.   Doors open at 6pm. Ticketing Information: Tickets Required "}
,{"id":"61024",
"name":"OUAB in the Kitchen - Knife Skills and Cooking Basics 101",
"time":"2018-04-23 18:00:00",
"location":"Ohio Union, Instructional Kitchen",
"description":" Join OUAB in the Instructional Kitchen at the Ohio Union for a chance to cook a meal of your own under the guidance of the Union's own professional chef, Chef Wolf. Following a cooking demonstration by the chef, students will collaborate with class members to create the menu providing a unique hands-on learning opportunity. In this fun and interactive environment students will enjoy a delicious meal and gain useful culinary skills to show off in their own kitchens.  Whether you're are a master chef in your own kitchen or a novice, there is an OUAB in the Kitchen program for you. Please note that due to safety, children are not permitted to attend this cooking class. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on April 22.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on April 23. Register here: https://ouab.osu.edu/secure/events/?eventId=31   Frequently Asked Questions "}
,{"id":"60226",
"name":"OUABe Fit: Yoga",
"time":"2018-04-23 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"This class moves through a variety of yoga poses in a balanced and systematic way. A key component of this class is Vinyasa work: the union of the breath and movement. Benefits of this type of training include heightened body awareness and mind focus, tension release, increased range of motion at the joints and an overall sensation of more balance in life. The session ends with restorative work, which energizes the body through passive stretch techniques. Sticky mats are provided or feel free to bring your own. "}
,{"id":"60229",
"name":"OUABe Fit: Zumba",
"time":"2018-04-24 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"Tired of the treadmill? This class is a high-energy, dance-inspired workout that fuses traditional Latin rhythms such as Salsa and Merengue with hip hop. Each class features simple, yet incredibly fun routines that help tone your body and get your heart rate up! Dance experience is not required; our instructor will work with participants to ensure the best results. You will have so much fun that you'll forget you're working out! "}
,{"id":"60372",
"name":"READING DAY OUAB Flicks for Free ft. The Greatest Showman",
"time":"2018-04-24 18:00:00",
"location":"U.S. Bank Conference Theater, Ohio Union",
"description":"A special showing in honor of Reading Day! OUAB weekly Flicks for Free series presents The Greatest Showman. (PG).   Inspired by the imagination of P. T. Barnum, The Greatest Showman is an original musical that celebrates the birth of show business & tells of a visionary who rose from nothing to create a spectacle that became a worldwide sensation. Stars: Hugh Jackman, Zac Efron, Zendaya Released: 2017   6pm SHOWING ONLY BuckID required for entry- BuckID admits two. Free popcorn & beverages! Ticketing Information: Tickets Not Required https://ouab.osu.edu/ "}
,{"id":"60295",
"name":"Cupcakes and Canvases with Cody",
"time":"2018-04-25 17:00:00",
"location":"Ohio Union, Creative Arts Room",
"description":" Relaxing and making time for entertainment is a crucial part of overall wellness. With this in mind, join us for an evening of cupcakes and canvases with local artist Cody Heichel. Participants are invited to relax, enjoy sweet treats and paint on a canvas with fellow students. Participants will be selected by OUAB Grad/Prof's all new lottery system for high demand programs.  To register for the the lottery, please sign up using the link below.  Lottery registration will be available until 11:59 p.m. on Thursday, April 12.  You may register for yourself and one guest.  Those selected to participate in the class will be notified by noon on April 13. Click link to register - https://ouab.osu.edu/secure/events/?eventId=15  * Note: Check-in for this event begins at 4:45 PM. Students should NOT arrive before this time.  Frequently Asked Questions "}
,{"id":"60244",
"name":"OUABe Fit: Barre None",
"time":"2018-04-25 18:00:00",
"location":"Ohio Union, Dance Room 1",
"description":"Barre None is a combination of ballet, Pilates, and yoga-inspired exercises designed to strengthen, sculpt, and lengthen your muscles. While this class targets your glutes, legs and core, it will improve your overall balance, flexibility and strength. "}
]